<?php

return [
    /*
    |--------------------------------------------------------------------------
    | 调试模式开关
    |--------------------------------------------------------------------------
    */
    'debug' => env('EASY_SMS_DEBUG', true),

    /*
    |--------------------------------------------------------------------------
    | 验证码长度
    |--------------------------------------------------------------------------
    */
    'length' => env('EASY_SMS_CODE_LENGTH', 4),

    /*
    |--------------------------------------------------------------------------
    | 默认的配置
    |--------------------------------------------------------------------------
    |
    | 默认的配置，提供以下选项：
    |
    | strategy： 默认的发送策略
    | gateways： 默认可用的发送网关
    |
    */
    'default' => [
        // 网关调用策略，默认：顺序调用
        'strategy' => \Overtrue\EasySms\Strategies\OrderStrategy::class,

        // 默认可用的发送网关
        'gateways' => [
            'debug',
            'aliyun',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | 可用的网关配置
    |--------------------------------------------------------------------------
    */
    'gateways' => [
        'debug' => [
            'code' => '0000',
        ],

        'aliyun' => [
            'access_key_id' => env('EASY_SMS_ALIYUN_ACCESS_KEY_ID'),
            'access_key_secret' => env('EASY_SMS_ALIYUN_ACCESS_KEY_SECRET'),
        ],
    ],
];
