<?php

/**
 * @disregard P1009
 */
return [
    /*
    |--------------------------------------------------------------------------
    | 用户模型设置
    |--------------------------------------------------------------------------
    | class  模型
    | fields 相关字段
    |      id           用户ID
    |      avatar_url   头像地址
    |      heading      右侧顶部显示的内容
    |      description  右侧描述位置显示内容
    */
    'user_model' => [
        'class' => \App\Models\User::class,
        'fields' => [
            'id' => 'id',
            'avatar_url' => 'avatar',
            'heading' => 'name',
            'description' => 'username',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | 用户状态标记显示
    |--------------------------------------------------------------------------
    | show  是否开启
    | field 状态字段
    */
    'active_state' => [
        'show' => false,
        'field' => 'is_active',
    ],
];
